Repository: pepr/progit2-cs
Catalog: omegat/ScottChacon_ProGit2-omegat.tmx
Source language: en
Languages: cs

source: [[_merge_rebase_work]] .You merge in the same work again into a new merge commit image::images/perils-of-rebasing-4.png[You merge in the same work again into a new merge commit.]
cs: [[_merge_rebase_work]] .Opakované začlenění stejné práce do nového bodu sloučení image::images/perils-of-rebasing-4.png[Opakované začlenění stejné práce do nového bodu sloučení.]

source: [[_pre_merge_rebase_work]] .Someone pushes rebased commits, abandoning commits you've based your work on image::images/perils-of-rebasing-3.png["Someone pushes rebased commits, abandoning commits you've based your work on."]
cs: [[_pre_merge_rebase_work]] .Někdo odešle přeskládané objekty revize a zahodí ty, z kterých jste při své práci vycházeli image::images/perils-of-rebasing-3.png["Někdo odešle přeskládané objekty revize a zahodí ty, z kterých jste při své práci vycházeli."]

source: [[_private_team]] ==== Private Small Team
cs: [[_private_team]] ==== Malý soukromý tým

source: [[_project_over_email]] ==== Public Project over Email
cs: [[_project_over_email]] ==== Veřejný projekt využívající elektronickou poštu

source: [[_public_project]] ==== Forked Public Project
cs: [[_public_project]] ==== Odštěpený veřejný projekt

source: [[_pushing_branches]] ==== Pushing
cs: [[_pushing_branches]] ==== Odesílání

source: [[_pushing_remotes]] ==== Pushing to Your Remotes
cs: [[_pushing_remotes]] ==== Odesílání do vzdálených repozitářů

source: [[_rebase_peril]] ==== The Perils of Rebasing
cs: [[_rebase_peril]] ==== Rizika spojená s přeskládáním

source: [[_rebase_rebase]] ==== Rebase When You Rebase
cs: [[_rebase_rebase]] ==== Přeskládejte po přeskládání

source: [[_rebase_rebase_work]] .Rebase on top of force-pushed rebase work.
cs: [[_rebase_rebase_work]] .Přeskládání nad vynuceně odeslaným výsledkem přeskládání

source: [[_rebasing]] === Rebasing
cs: [[_rebasing]] === Přeskládání

source: [[_remote_branches]] === Remote Branches
cs: [[_remote_branches]] === Vzdálené větve

source: [[_remote_repos]] === Working with Remotes
cs: [[_remote_repos]] === Práce se vzdálenými repozitáři

source: [[_removing_files]] ==== Removing Files
cs: [[_removing_files]] ==== Odstraňování souborů

source: [[_sharing_tags]] ==== Sharing Tags
cs: [[_sharing_tags]] ==== Sdílení značek

source: [[_switching_branches]] ==== Switching Branches
cs: [[_switching_branches]] ==== Přepínání větví

source: [[_topic_branch]] ==== Topic Branches
cs: [[_topic_branch]] ==== Tématické větve

source: [[_tracking_branches]] ==== Tracking Branches
cs: [[_tracking_branches]] ==== Sledující větve

source: [[_tracking_files]] ==== Tracking New Files
cs: [[_tracking_files]] ==== Sledování nových souborů

source: [[_undoing]] === Undoing Things
cs: [[_undoing]] === Návrat do předchozího stavu

source: [[_unstaging]] ==== Unstaging a Staged File
cs: [[_unstaging]] ==== Odstranění souboru z oblasti připravených změn

source: [[_viewing_history]] === Viewing the Commit History
cs: [[_viewing_history]] === Zobrazení historie revizí

source: [[divergent_history]] .Divergent history image::images/advance-master.png[Divergent history.]
cs: [[divergent_history]] .Rozbíhající se historie image::images/advance-master.png[Rozbíhající se historie.]

source: [[limit_options]] .Options to limit the output of `git log` [cols="2,4",options="header"] |================================ | Option | Description | `-(n)` | Show only the last n commits | `--since`, `--after` | Limit the commits to those made after the specified date.
cs: [[limit_options]] .Volby pro omezení výstupu příkazu `git log` [cols="2,4",options="header"] |================================ | Volba | Popis | `-(n)` | Zobrazí pouze posledních n revizí. | `--since`, `--after` | Omezí výpis na revize zapsané po zadaném datu.

source: [[log_options]] .Common options to `git log` [cols="1,4",options="header"] |================================ | Option | Description | `-p` | Show the patch introduced with each commit.
cs: [[log_options]] .Běžné volby příkazu `git log` [cols="1,4",options="header"] |================================ | Volba | Popis | `-p` | Zobrazí záplatu (**p**atch) zahrnutou do každé revize.

source: [[lrbranch_b]] .A ``silo'' view of progressive-stability branching image::images/lr-branches-2.png[A ``silo'' view of progressive-stability branching.]
cs: [[lrbranch_b]] .„Zásobníkový“ pohled na větvení podle stupně stability image::images/lr-branches-2.png[„Zásobníkový“ pohled na větvení podle stupně stability.]

source: [[pretty_format]] .Useful options for `git log --pretty=format` [cols="1,4",options="header"] |================================ | Option | Description of Output | `%H` | Commit hash | `%h` | Abbreviated commit hash | `%T` | Tree hash | `%t` | Abbreviated tree hash | `%P` | Parent hashes | `%p` | Abbreviated parent hashes | `%an` | Author name | `%ae` | Author email | `%ad` | Author date (format respects the --date=option) | `%ar` | Author date, relative | `%cn` | Committer name | `%ce` | Committer email | `%cd` | Committer date | `%cr` | Committer date, relative | `%s` | Subject |================================
cs: [[pretty_format]] .Užitečné volby pro `git log --pretty=format` [cols="1,4",options="header"] |================================ | Parametr | Popis výstupu | %H | Otisk revize (*H* jako hash) | %h | Zkrácený otisk revize | %T | Otisk stromu (*T* jako tree) | %t | Zkrácený otisk stromu | %P | Otisky rodičovských revizí (*P* jako parent) | %p | Zkrácené otisky rodičovských revizí | %an | Jméno autora (**a**uthor **n**ame) | %ae | E-mail autora (**a**uthor **e**-mail) | %ad | Datum autora (formát respektuje --date=volba) | %ar | Datum autora, relativní | %cn | Jméno autora revize (**c**ommitter **n**ame) | %ce | E-mail autora revize (**c**ommitter **e**-mail) | %cd | Datum autora revize (**c**ommitter **d**ate) | %cr | Datum autora revize, relativní | %s | Předmět (**s**ubject) |================================

source: [[psp_b]] .Commit history after `featureA` work.
cs: [[psp_b]] .Historie revizí po přeskládání práce z `featureA`.

source: [[rbdiag_e]] .A history with a topic branch off another topic branch image::images/interesting-rebase-1.png[A history with a topic branch off another topic branch.]
cs: [[rbdiag_e]] .Historie s tématickou větví vytvořenou z jiné tématické větve image::images/interesting-rebase-1.png[Historie s tématickou větví vytvořenou z jiné tématické větve.]

source: [[rbdiag_g]] .Fast-forwarding your master branch to include the client branch changes image::images/interesting-rebase-3.png[Fast-forwarding your master branch to include the client branch changes.]
cs: [[rbdiag_g]] .Přidání změn z větve `client` posunutím větve `master` „rychle vpřed“ image::images/interesting-rebase-3.png[Přidání změn z větve `client` posunutím větve `master` „rychle vpřed“.]

source: [[rbdiag_h]] .Rebasing your server branch on top of your master branch image::images/interesting-rebase-4.png[Rebasing your server branch on top of your master branch.]
cs: [[rbdiag_h]] .Přeskládání větve `server` na vrchol větve `master` image::images/interesting-rebase-4.png[Přeskládání větve `server` na vrchol větve `master`.]

source: [[rbdiag_i]] .Final commit history image::images/interesting-rebase-5.png[Final commit history.]
cs: [[rbdiag_i]] .Historie poslední revize image::images/interesting-rebase-5.png[Historie poslední revize.]

source: [[wfdiag_b]] .Integration-manager workflow.
cs: [[wfdiag_b]] .Pracovní postup s integračním manažerem.

source: [[wfdiag_c]] .Benevolent dictator workflow.
cs: [[wfdiag_c]] .Pracovní postup s benevolentním diktátorem.

source: [preface] == Dedications
cs: [preface] == Věnování

source: [preface] == Preface by Ben Straub
cs: [preface] == Předmluva Bena Strauba

source: [preface] == Preface by Scott Chacon
cs: [preface] == Předmluva Scotta Chacona

source: [source,console] ---- $ git checkout -b featureB origin/master # (work) $ git commit $ git push myfork featureB # (email maintainer) $ git fetch origin ----
cs: [source,console] ---- $ git checkout -b featureB origin/master # (nějaká práce) $ git commit $ git push myfork featureB # (odeslání e-mailu správci) $ git fetch origin ----

source: [source,console] ---- $ git clone (url) $ cd project $ git checkout -b featureA # (work) $ git commit # (work) $ git commit ----
cs: [source,console] ---- $ git clone (url) $ cd project $ git checkout -b featureA # (něco uděláte) $ git commit # (něco uděláte) $ git commit ----

source: [source,console] ---- $ git fetch [remote-name] ----
cs: [source,console] ---- $ git fetch [jméno-vzdáleného-repozitáře] ----

source: [source,console] ---- $ git help <verb> $ git <verb> --help $ man git-<verb> ----
cs: [source,console] ---- $ git help <příkaz> $ git <příkaz> --help $ man git-<příkaz> ----

source: [source,console] ---- $ git log -Sfunction_name ----
cs: [source,console] ---- $ git log -Sjmeno_funkce ----

source: [source,console] ---- $ git mv file_from file_to ----
cs: [source,console] ---- $ git mv stare_jmeno_souboru nove_jmeno_souboru ----

source: [source,text] ---- Short (50 chars or less) summary of changes
cs: [source,text] ---- Krátké shrnutí změn (do 50 znaků)

source: [source] ---- # no .a files *.a
cs: [source] ---- # žádné soubory s příponou .a *.a

source: _This edition is dedicated to my girls.
cs: _Toto vydání je věnováno mým děvčatům.

source: _To my wife, Becky, without whom this adventure never would have begun.
cs: _Mé ženě Becky, bez které by toto dobrodružství nikdy nemohlo začít.

source: `--reuseaddr` allows the server to restart without waiting for old connections to time out, the `--base-path` option allows people to clone projects without specifying the entire path, and the path at the end tells the Git daemon where to look for repositories to export.
cs: `--reuseaddr` umožňuje serveru restartování bez nutnosti čekat na vypršení časového limitu pro stará spojení, parametr `--base-path` umožňuje uživatelům klonovat projekty, aniž by museli zadávat celou cestu, a cesta na konci příkazu říká démonovi Git, kde má hledat repozitáře určené k exportu.

source: `/etc/gitconfig` file: Contains values for every user on the system and all their repositories.
cs: Soubor `/etc/gitconfig`: Obsahuje údaje pro každého uživatele systému a pro všechny jejich repozitáře.

source: ``Private,'' in this context, means closed-source – not accessible to the outside world.
cs: „Soukromý“ v této souvislosti znamená s uzavřeným zdrojovým kódem -- okolní svět k němu nemá přístup.

source: `config` file in the Git directory (that is, `.git/config`) of whatever repository you're currently using: Specific to that single repository.
cs: Soubor `config` v gitovém adresáři (tj. `.git/config`) repozitáře, který momentálně používáte: Patří konkrétně k tomuto jedinému repozitáři.

source: `experiment..master` shows you everything in `master` not reachable from `experiment`:
cs: Výraz `experiment..master` zobrazí vše ve větvi `master`, co není dostupné ve větvi `experiment`:

source: `filter-branch` is the tool you probably want to use to scrub your entire history.
cs: Nástrojem, který hledáte k opravení celé historie, je `filter-branch`.

source: `git add` is a multipurpose command – you use it to begin tracking new files, to stage files, and to do other things like marking merge-conflicted files as resolved.
cs: Příkaz `git add` je víceúčelový -- používá se k zahájení sledování nových souborů, k přípravě souborů k zapsání a k dalším věcem, jako je například označení vyřešených případů kolize souborů při slučování.

source: `git svn` has two commands to help with this issue.
cs: Nástroj `git svn` vám k řešení tohoto problému nabízí dva příkazy.

source: `~/.gitconfig` or `~/.config/git/config` file: Specific to your user.
cs: Soubor `~/.gitconfig` nebo `~/.config/git/config`: Patří k vašemu uživatelskému účtu.

source: and `git diff --cached` to see what you've staged so far (--staged and --cached are synonyms):
cs: a příkaz `git diff --cached` ukáže změny, které už jsou připraveny k zapsání (`--staged` a `--cached` jsou synonyma):

source: and it works fine.
cs: a vše bezvadně funguje.

source: between, but conventions vary here ----
cs: prázdné řádky, ale tady se zvyklosti mohou lišit. ----

source: due to binary name differences.
cs: kvůli odlišnosti jmen binárních souborů.

source: image::images/areas.png["Working directory, staging area, and Git directory."]
cs: image::images/areas.png["Pracovní adresář, oblast připravených změn a adresář Git."]

source: image::images/benevolent-dictator.png[Benevolent dictator workflow.]
cs: image::images/benevolent-dictator.png[Pracovní postup s benevolentním diktátorem.]

source: image::images/centralized.png[Centralized version control diagram]
cs: image::images/centralized.png[Centralizovaná správa verzí.]

source: image::images/centralized_workflow.png[Centralized workflow.]
cs: image::images/centralized_workflow.png[Centralizovaný pracovní postup.]

source: image::images/deltas.png[Storing data as changes to a base version of each file.]
cs: image::images/deltas.png[Ukládání dat jako změn vůči základní verzi každého souboru.]

source: image::images/distributed.png[Distributed version control diagram]
cs: image::images/distributed.png[Diagram pro distribuovaný systém správy verzí.]

source: image::images/git-diff-check.png[Output of `git diff --check`.]
cs: image::images/git-diff-check.png[Výstup příkazu `git diff --check`.]

source: image::images/git-osx-installer.png[Git OS X installer.]
cs: image::images/git-osx-installer.png[Instalátor Gitu pro OS X.]

source: image::images/integration-manager.png[Integration-manager workflow.]
cs: image::images/integration-manager.png[Pracovní postup s integračním manažerem.]

source: image::images/lifecycle.png[The lifecycle of the status of your files.]
cs: image::images/lifecycle.png[Cyklus stavů vašich souborů.]

source: image::images/local.png[Local version control diagram]
cs: image::images/local.png[Diagram lokální správy verzí.]

source: image::images/managed-team-1.png[Jessica's initial commit history.]
cs: image::images/managed-team-1.png[Jessičina výchozí historie revizí.]

source: image::images/managed-team-2.png[Jessica's history after committing on a feature branch.]
cs: image::images/managed-team-2.png[Jessičina historie po zapsání revizí do větve s úkolem.]

source: image::images/managed-team-3.png[Jessica's history after merging both her topic branches.]
cs: image::images/managed-team-3.png[Historie Jessicy po začlenění obou jejích tématických větví.]

source: image::images/managed-team-flow.png[Basic sequence of this managed-team workflow.]
cs: image::images/managed-team-flow.png[Základní posloupnost událostí pracovního postupu řízeného týmu.]

source: image::images/perils-of-rebasing-5.png[Rebase on top of force-pushed rebase work.]
cs: image::images/perils-of-rebasing-5.png[Přeskládání nad vynuceně odeslaným výsledkem přeskládání.]

source: image::images/public-small-1.png[Initial commit history with `featureB` work.]
cs: image::images/public-small-1.png[Počáteční historie revizí s prací na `featureB`.]

source: image::images/public-small-2.png[Commit history after `featureA` work.]
cs: image::images/public-small-2.png[Historie revizí po přeskládání práce z `featureA`.]

source: image::images/public-small-3.png[Commit history after `featureBv2` work.]
cs: image::images/public-small-3.png[Historie revizí po práci ve větvi `featureBv2`.]

source: image::images/small-team-1.png[John's divergent history.]
cs: image::images/small-team-1.png[Johnova odchylující se historie.]

source: image::images/small-team-2.png[John's repository after merging `origin/master`.]
cs: image::images/small-team-2.png[Johnův repozitář po začlenění `origin/master`.]

source: image::images/small-team-3.png[John's history after pushing to the `origin` server.]
cs: image::images/small-team-3.png[Johnova historie po odeslání revize na server `origin`.]

source: image::images/small-team-4.png[Jessica's topic branch.]
cs: image::images/small-team-4.png[Jessičina tématická větev.]

source: image::images/small-team-5.png[Jessica's history after fetching John's changes.]
cs: image::images/small-team-5.png[Historie Jessicy po vyzvednutí Johnových změn.]

source: image::images/small-team-6.png[Jessica's history after merging John's changes.]
cs: image::images/small-team-6.png[Jessičina historie po začlenění Johnových změn.]

source: image::images/small-team-7.png[Jessica's history after pushing all changes back to the server.]
cs: image::images/small-team-7.png[Jessičina historie po odeslání všech změn zpět na server.]

source: image::images/small-team-flow.png[General sequence of events for a simple multiple-developer Git workflow.]
cs: image::images/small-team-flow.png[Obecná posloupnost událostí pro jednoduchý pracovní postup s více vývojáři.]

source: image::images/snapshots.png[Git stores data as snapshots of the project over time.]
cs: image::images/snapshots.png[Git ukládá data jako snímky projektu v daném čase.]

source: or the second version:
cs: Nebo do druhé verze:

source: preceded by a single space, with blank lines in
cs: před kterou se uvádí jedna mezera. Mezi odrážky se vkládají

source: to this:
cs: na:

source: what happened
cs: co bylo provedeno

source: you have to use
cs: budete muset použít:

source: you put this script:
cs: vložte tento skript:

source: {remote}: modified file Hit return to start merge resolution tool (opendiff): ----
cs: {remote}: modified file Hit return to start merge resolution tool (opendiff): ---- Česky: Tato zpráva se zobrazila, protože hodnota `'merge.tool'` (nástroj pro slučování) není nakonfigurována... a následuje návod ke spuštění nápovědy. Dále... `'git mergetool'` se nyní pokusí spustit jeden z následujících nástrojů: ... Následuje informace o souboru s konfliktem a končí to... Stiskněte klávesu Return (Enter) pro spuštění opendiff.

source: | `--abbrev-commit` | Show only the first few characters of the SHA-1 checksum instead of all 40.
cs: | `--abbrev-commit` | Zobrazí jen několik prvních znaků kontrolního součtu SHA-1 místo všech 40.

source: | `--author` | Only show commits in which the author entry matches the specified string.
cs: | `--author` | Zobrazí pouze revize, u kterých autor příspěvku odpovídá zadanému řetězci.

source: | `--committer` | Only show commits in which the committer entry matches the specified string.
cs: | `--committer` | Zobrací pouze revize, u kterých autor revize odpovídá zadanému řetězci.

source: | `--graph` | Display an ASCII graph of the branch and merge history beside the log output.
cs: | `--graph` | Zobrazí vedle výstupu logu ASCII graf větve a historii slučování.

source: | `--grep` | Only show commits with a commit message containing the string | `-S` | Only show commits adding or removing code matching the string |================================
cs: | `--grep` | Zobrazí pouze revize, které ve zprávě k revizi obsahují zadaný řetězec. | `-S` | Zobrazí pouze revize, které přidaly nebo odebraly kód se zadaným řetězcem. |================================

source: | `--name-only` | Show the list of files modified after the commit information.
cs: | `--name-only` | Za informacemi o revizi zobrazí seznam změněných souborů.

source: | `--name-status` | Show the list of files affected with added/modified/deleted information as well.
cs: | `--name-status` | Zobrazí seznam dotčených souborů spolu s informací přidáno/změněno/smazáno.

source: | `--pretty` | Show commits in an alternate format.
cs: | `--pretty` | Zobrazí revize v alternativním formátu.

source: | `--relative-date` | Display the date in a relative format (for example, ``2 weeks ago'') instead of using the full date format.
cs: | `--relative-date` | Zobrazí datum v relativním formátu (např. „2 weeks ago“, tj. před 2 týdny) místo data v úplném tvaru.

source: | `--shortstat` | Display only the changed/insertions/deletions line from the --stat command.
cs: | `--shortstat` | Zobrazí pouze řádek změněno/vloženo/smazáno z příkazu `--stat`.

source: | `--stat` | Show statistics for files modified in each commit.
cs: | `--stat` | Zobrazí statistiku pro změněné soubory v každé revizi.

source: | `--until`, `--before` | Limit the commits to those made before the specified date.
cs: | `--until`, `--before` | Omezí výpis na revize zapsané před zadaným datem.
